
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>游戏设计目标 · Ruins Land</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="YuiLexi">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-katex/katex.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-sidebar-style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-anchor-navigation-ex/style/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-lightbox/css/lightbox.min.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-auto-scroll-table/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="4游戏规则设计/4游戏规则设计.html" />
    
    
    <link rel="prev" href="2游戏故事背景.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    
    
        
        <li>
            <a href="https://blog.yuilexi.cn" target="_blank" class="custom-link">个人博客</a>
        </li>
    
        
        <li>
            <a href="https://github.com/YuiLexi" target="_blank" class="custom-link">GitHub</a>
        </li>
    
    

    
    <li class="divider"></li>
    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    说明文件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../开发日志.html">
            
                <a href="../开发日志.html">
            
                    
                    开发日志
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">游戏策划</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="1游戏基本信息.html">
            
                <a href="1游戏基本信息.html">
            
                    
                    游戏基本信息
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="2游戏故事背景.html">
            
                <a href="2游戏故事背景.html">
            
                    
                    游戏故事背景
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="2.3" data-path="3游戏设计目标.html">
            
                <a href="3游戏设计目标.html">
            
                    
                    游戏设计目标
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.4" data-path="4游戏规则设计/4游戏规则设计.html">
            
                <a href="4游戏规则设计/4游戏规则设计.html">
            
                    
                    游戏规则设计
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.4.1" data-path="4游戏规则设计/用户输入设计.html">
            
                <a href="4游戏规则设计/用户输入设计.html">
            
                    
                    用户输入设计
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.5" data-path="5游戏美术设计.html">
            
                <a href="5游戏美术设计.html">
            
                    
                    游戏美术设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.6" data-path="6游戏技术平台.html">
            
                <a href="6游戏技术平台.html">
            
                    
                    游戏技术平台
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.7" data-path="7游戏开发周期和团队.html">
            
                <a href="7游戏开发周期和团队.html">
            
                    
                    游戏开发周期和团队
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.8" data-path="8游戏发布计划.html">
            
                <a href="8游戏发布计划.html">
            
                    
                    游戏发布计划
            
                </a>
            

            
        </li>
    

    
        
        <li class="header">游戏想法收录</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="../游戏想法收录/游戏想法收录.html">
            
                <a href="../游戏想法收录/游戏想法收录.html">
            
                    
                    游戏想法收录
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >游戏设计目标</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <div id="anchor-navigation-ex-navbar"><i class="fa fa-navicon"></i><ul><li><span class="title-icon "></span><a href="#&#x6E38;&#x620F;&#x7684;&#x4E3B;&#x9898;"><b></b>&#x6E38;&#x620F;&#x7684;&#x4E3B;&#x9898;</a></li><li><span class="title-icon "></span><a href="#&#x6E38;&#x620F;&#x73A9;&#x6CD5;"><b></b>&#x6E38;&#x620F;&#x73A9;&#x6CD5;</a></li><li><span class="title-icon "></span><a href="#&#x6E38;&#x620F;&#x96BE;&#x5EA6;"><b></b>&#x6E38;&#x620F;&#x96BE;&#x5EA6;</a></li><li><span class="title-icon "></span><a href="#&#x6E38;&#x620F;&#x4EE3;&#x5165;&#x611F;"><b></b>&#x6E38;&#x620F;&#x4EE3;&#x5165;&#x611F;</a></li></ul></div><a href="#&#x6E38;&#x620F;&#x7684;&#x4E3B;&#x9898;" id="anchorNavigationExGoTop"><i class="fa fa-arrow-up"></i></a><h1 id="&#x6E38;&#x620F;&#x7684;&#x4E3B;&#x9898;"><a name="&#x6E38;&#x620F;&#x7684;&#x4E3B;&#x9898;" class="anchor-navigation-ex-anchor" href="#&#x6E38;&#x620F;&#x7684;&#x4E3B;&#x9898;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x6E38;&#x620F;&#x7684;&#x4E3B;&#x9898;</h1>
<p>&#x6E38;&#x620F;&#x7684;&#x4E3B;&#x9898;&#x662F;&#xFF1A;&#x6587;&#x660E;&#x7684;&#x6BC1;&#x706D;&#x4E0E;&#x65B0;&#x751F;&#xFF0C;&#x7A81;&#x51FA;&#x6587;&#x660E;&#x968F;&#x5386;&#x53F2;&#x4E0D;&#x65AD;&#x8FED;&#x4EE3;&#x3002;</p>
<ul>
<li><p>&#x5143;&#x7D20;&#x4E16;&#x754C;&#x89C2;&#xFF1A;&#x4E16;&#x754C;&#x4E0D;&#x4EC5;&#x6709;&#x7269;&#x8D28;&#x6784;&#x6210;&#xFF0C;&#x542B;&#x5B58;&#x5728;&#x7279;&#x6B8A;&#x7684;&#x5143;&#x7D20;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x5143;&#x7D20;&#x624D;&#x52FE;&#x52D2;&#x51FA;&#x4E16;&#x754C;&#x7684;&#x4E30;&#x5BCC;&#x591A;&#x5F69;&#x3002;</p>
</li>
<li><p>&#x5F31;&#x9B54;&#x6CD5;&#x4E16;&#x754C;&#x89C2;&#xFF1A;&#x4E16;&#x754C;&#x5B58;&#x5728;&#x9B54;&#x6CD5;&#xFF0C;&#x4E3B;&#x8981;&#x4F53;&#x73B0;&#x5728;&#x5492;&#x8BED;&#x548C;&#x6CD5;&#x9635;&#xFF0C;&#x7528;&#x4E8E;&#x5F15;&#x5BFC;&#x548C;&#x8FD0;&#x4F5C;&#x5143;&#x7D20;&#x529B;</p>
</li>
<li>&#x539F;&#x59CB;&#xFF1A;&#x4F53;&#x73B0;&#x5728;&#x751F;&#x6D3B;&#x65B9;&#x5F0F;&#x4E0A;&#xFF0C;&#x91C7;&#x7528;&#x539F;&#x59CB;&#x793E;&#x4F1A;&#x7684;&#x751F;&#x4EA7;&#x65B9;&#x5F0F;&#xFF0C;&#x66F4;&#x80FD;&#x4F53;&#x73B0;&#x4E00;&#x4E2A;&#x65B0;&#x6587;&#x660E;&#x706B;&#x79CD;&#x7684;&#x5F00;&#x59CB;</li>
</ul>
<h1 id="&#x6E38;&#x620F;&#x73A9;&#x6CD5;"><a name="&#x6E38;&#x620F;&#x73A9;&#x6CD5;" class="anchor-navigation-ex-anchor" href="#&#x6E38;&#x620F;&#x73A9;&#x6CD5;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x6E38;&#x620F;&#x73A9;&#x6CD5;</h1>
<p>&#x6E38;&#x620F;&#x7684;&#x6838;&#x5FC3;&#x73A9;&#x6CD5;&#x4E3B;&#x8981;&#x6709;&#x4E24;&#x79CD;&#xFF1A;</p>
<ol>
<li><p>&#x6A21;&#x62DF;&#x7ECF;&#x8425;</p>
<p> &#x200B;    &#x5305;&#x542B;&#x79CD;&#x690D;&#x3001;&#x755C;&#x7267;&#x3001;&#x9493;&#x9C7C;&#x3001;&#x9A6F;&#x517B;&#x3001;&#x5546;&#x5E97;&#x7B49;&#x73A9;&#x6CD5;&#x3002;</p>
</li>
<li><p>&#x751F;&#x5B58;&#x5192;&#x9669;</p>
<p> &#x200B;    &#x5305;&#x542B;&#x63A2;&#x7D22;&#x3001;&#x6218;&#x6597;&#x3001;&#x6316;&#x77FF;&#x3001;&#x6536;&#x96C6;&#x7B49;&#x73A9;&#x6CD5;&#x3002;</p>
</li>
</ol>
<p>&#x6E38;&#x620F;&#x7684;&#x5927;&#x81F4;&#x6D41;&#x7A0B;&#xFF1A;</p>
<ol>
<li>&#x6E38;&#x620F;&#x7684;&#x524D;&#x671F;&#xFF1A;&#x901A;&#x8FC7;&#x6536;&#x96C6;&#x3001;&#x780D;&#x6811;&#x7B49;&#xFF0C;&#x83B7;&#x5F97;&#x57FA;&#x7840;&#x6750;&#x6599;&#xFF0C;&#x5E76;&#x5F00;&#x59CB;&#x79CD;&#x690D;&#x3001;&#x755C;&#x7267;&#xFF0C;&#x4EE5;&#x4FBF;&#x4E8E;&#x83B7;&#x5F97;&#x751F;&#x5B58;&#x5FC5;&#x5907;&#x7684;&#x7269;&#x8D44;&#x3002;&#x5728;&#x4E2D;&#x5FC3;&#x57CE;&#x9547;&#x4E0D;&#x65AD;&#x53D1;&#x5C55;&#xFF0C;&#x5E76;&#x4E14;&#x4E0E;&#x5C45;&#x6C11;&#x5EFA;&#x7ACB;&#x826F;&#x597D;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x5BFB;&#x627E;&#x57CE;&#x9547;&#x8FB9;&#x7F18;&#x7684;&#x4F20;&#x9001;&#x6CD5;&#x9635;&#xFF0C;&#x901A;&#x8FC7;&#x67D0;&#x4E9B;&#x6750;&#x6599;&#x8FDB;&#x884C;&#x6FC0;&#x6D3B;&#xFF0C;&#x4EE5;&#x4FBF;&#x4E8E;&#x524D;&#x5F80;&#x5176;&#x4ED6;&#x7684;&#x533A;&#x57DF;&#x3002;</li>
<li>&#x6E38;&#x620F;&#x524D;&#x4E2D;&#x671F;&#xFF1A;&#x6FC0;&#x6D3B;&#x4F20;&#x9001;&#x6CD5;&#x9635;&#x540E;&#xFF0C;&#x5C31;&#x4F1A;&#x524D;&#x5F80;&#x4E0D;&#x540C;&#x7684;&#x533A;&#x57DF;&#x63A2;&#x7D22;&#x3002;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x533A;&#x57DF;&#x5185;&#xFF0C;&#x4F1A;&#x6536;&#x96C6;&#x5230;&#x8FD9;&#x79CD;&#x7269;&#x54C1;&#xFF0C;&#x5305;&#x542B;&#x4F46;&#x4E0D;&#x9650;&#x4E8E;&#x79CD;&#x5B50;&#x3001;&#x6750;&#x6599;&#x3001;&#x88C5;&#x5907;&#x3001;&#x9B54;&#x6CD5;&#x9053;&#x5177;&#x3001;&#x56FE;&#x817E;&#x3001;&#x5492;&#x8BED;&#x4E66;&#x3001;&#x9635;&#x6CD5;&#x56FE;&#x7B49;&#xFF0C;&#x7528;&#x4E8E;&#x5FEB;&#x901F;&#x63A8;&#x8FDB;&#x4E3B;&#x5C9B;&#x7684;&#x53D1;&#x5C55;&#x3002;</li>
<li>&#x6E38;&#x620F;&#x4E2D;&#x671F;&#xFF1A;&#x901A;&#x8FC7;&#x6BCF;&#x4E2A;&#x533A;&#x57DF;&#x7684;&#x7EBF;&#x7D22;&#xFF0C;&#x627E;&#x5230;&#x5BF9;&#x5E94;&#x5143;&#x7D20;&#x5927;&#x9646;&#x7684;<strong>&#x8FDC;&#x53E4;&#x9057;&#x8FF9;</strong>&#x5165;&#x53E3;&#x7684;&#x4F20;&#x9001;&#x6CD5;&#x9635;&#xFF0C;&#x5305;&#x542B;&#x4F46;&#x4E0D;&#x9650;&#x4E8E;&#x5730;&#x4E0B;&#x3001;&#x5929;&#x7A7A;&#x3001;&#x9AD8;&#x5C71;&#x3001;&#x6D77;&#x6D0B;&#x5730;&#x533A;&#x3002;&#x5728;&#x8FDB;&#x5165;&#x8FD9;&#x4E9B;&#x9057;&#x8FF9;&#x4E4B;&#x524D;&#xFF0C;&#x9700;&#x8981;&#x51C6;&#x5907;&#x5BF9;&#x5E94;&#x7684;&#x9B54;&#x6CD5;&#x7269;&#x54C1;&#x3001;&#x6216;&#x8005;&#x88C5;&#x5907;&#x3001;&#x6216;&#x8005;&#x6750;&#x6599;&#xFF0C;&#x4EE5;&#x5E94;&#x5BF9;&#x8FDC;&#x53E4;&#x9057;&#x8FF9;&#x4E2D;&#x5371;&#x9669;&#x7684;&#x73AF;&#x5883;&#x3002;</li>
<li>&#x6E38;&#x620F;&#x4E2D;&#x540E;&#x671F;&#xFF1A;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x73A9;&#x6CD5;&#x548C;&#x8DEF;&#x7EBF;&#x53EF;&#x4EE5;&#x9009;&#x62E9;<ol>
<li>&#xFF08;&#x5B98;&#x65B9;&#x4E3B;&#x63A8;&#xFF09;&#x4F20;&#x9001;&#x6CD5;&#x9635;&#x79BB;&#x5F00;&#x4E16;&#x754C;&#xFF0C;&#x89E6;&#x53D1;&#x5927;&#x7ED3;&#x5C40;&#xFF1A;&#x901A;&#x8FC7;&#x6536;&#x96C6;&#x9690;&#x85CF;&#x5728;&#x4E16;&#x754C;&#x5404;&#x5730;&#x7684;&#x3001;&#x72EC;&#x4E00;&#x65E0;&#x4E8C;&#x7684;<strong>&#x5143;&#x7D20;&#x672C;&#x6E90;&#x6676;&#x6838;</strong>&#xFF0C;&#x6FC0;&#x6D3B;&#x57CE;&#x9547;&#x4E2D;&#x5FC3;&#x4E0A;&#x9762;&#x7684;<strong>&#x65F6;&#x7A7A;&#x4F20;&#x9001;&#x95E8;</strong>&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x9057;&#x7559;&#x5728;&#x8FDC;&#x53E4;&#x9057;&#x8FF9;&#x91CC;&#x9762;&#x7684;<strong>&#x4F20;&#x9001;&#x6CD5;&#x9635;&#x788E;&#x7247;</strong>&#xFF0C;&#x7EC4;&#x5408;&#x6210;&#x4F20;&#x9001;&#x6CD5;&#x9635;&#xFF0C;&#x771F;&#x6B63;&#x6253;&#x5F00;<strong>&#x65F6;&#x7A7A;&#x4F20;&#x9001;&#x95E8;</strong>&#xFF0C;&#x7136;&#x540E;&#x79BB;&#x5F00;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x3002;</li>
<li>&#xFF08;&#x7ED3;&#x5C40;&#x4E8C;&#xFF09;&#x4FEE;&#x8865;&#x65F6;&#x7A7A;&#x88C2;&#x75D5;&#xFF1A;&#x73A9;&#x5BB6;&#x901A;&#x8FC7;<strong>&#x65F6;&#x7A7A;&#x88C2;&#x75D5;</strong>&#xFF0C;&#x8BEF;&#x5165;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x3002;&#x65F6;&#x7A7A;&#x88C2;&#x75D5;&#x4E2D;&#x7684;&#x89C4;&#x5219;&#x4E0D;&#x5C5E;&#x4E8E;&#x8FD9;&#x7247;&#x5927;&#x9646;&#xFF0C;&#x5E76;&#x4E14;&#x7ED9;&#x5C45;&#x6C11;&#x7684;&#x751F;&#x6D3B;&#x9020;&#x6210;&#x5F88;&#x5927;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x4E3A;&#x4E86;&#x5927;&#x9646;&#x4E0A;&#x7684;&#x65B0;&#x6587;&#x660E;&#x7684;&#x5EF6;&#x7EED;&#xFF0C;&#x5229;&#x7528;<strong>&#x5143;&#x7D20;&#x672C;&#x6E90;&#x6676;&#x6838;</strong>&#x7684;&#x529B;&#x91CF;&#xFF0C;&#x5F3A;&#x884C;&#x5173;&#x95ED;&#x88C2;&#x75D5;&#xFF0C;&#x4EE5;&#x4FBF;&#x4E8E;&#x8FD9;&#x4F1A;&#x5BFC;&#x81F4;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0E;&#x5176;&#x4ED6;&#x4E16;&#x754C;&#x5F7B;&#x5E95;&#x5931;&#x53BB;&#x8054;&#x7CFB;&#xFF0C;&#x65F6;&#x7A7A;&#x4F20;&#x9001;&#x95E8;&#x4E5F;&#x5C06;&#x5931;&#x53BB;&#x4F5C;&#x7528;&#x3002;</li>
<li>&#xFF08;&#x7ED3;&#x5C40;&#x4E09;&#xFF09;&#x4E0E;&#x9ED1;&#x6697;&#x6297;&#x4E89;&#xFF1A;&#x5229;&#x7528;<strong>&#x5143;&#x7D20;&#x672C;&#x6E90;&#x6676;&#x6838;</strong>&#x5BF9;&#x6297;&#x9ED1;&#x6697;&#x4E00;&#x65CF;&#xFF0C;&#x8BA9;&#x90AA;&#x6076;&#x751F;&#x7269;&#x5728;&#x4E16;&#x754C;&#x4E0A;&#x6D88;&#x5931;&#xFF0C;&#x4F7F;&#x5F97;&#x9057;&#x6C11;&#x80FD;&#x591F;&#x5411;&#x5916;&#x63A2;&#x7D22;&#x5EFA;&#x8BBE;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#xFF08;&#x7531;&#x57CE;&#x9547; -&gt; &#x6574;&#x4E2A;&#x4E16;&#x754C;&#xFF09;&#x3002;</li>
<li>&#xFF08;&#x81EA;&#x4E3B;&#x73A9;&#x6CD5;&#xFF09;&#x4F11;&#x95F2;&#x5411;&#xFF1A;&#x6269;&#x5927;&#x4E3B;&#x5C9B;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x62DB;&#x52DF;&#x66F4;&#x591A;&#x7684;NPC&#xFF0C;&#x63D0;&#x5347;&#x4E16;&#x754C;&#x7684;&#x6587;&#x660E;&#x7A0B;&#x5EA6;&#x7B49;&#x7B49;</li>
</ol>
</li>
</ol>
<h1 id="&#x6E38;&#x620F;&#x96BE;&#x5EA6;"><a name="&#x6E38;&#x620F;&#x96BE;&#x5EA6;" class="anchor-navigation-ex-anchor" href="#&#x6E38;&#x620F;&#x96BE;&#x5EA6;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x6E38;&#x620F;&#x96BE;&#x5EA6;</h1>
<p>&#x6E38;&#x620F;&#x96BE;&#x5EA6;&#x8BBE;&#x8BA1;&#xFF1A;</p>
<ul>
<li>&#x79CD;&#x690D;&#x548C;&#x755C;&#x7267;&#xFF1A;&#x8BBE;&#x8BA1;&#x8F83;&#x957F;&#x7684;&#x751F;&#x4EA7;&#x5468;&#x671F;&#xFF0C;&#x76EE;&#x7684;&#x662F;&#x907F;&#x514D;&#x8F7B;&#x677E;&#x83B7;&#x5F97;&#x751F;&#x6D3B;&#x5FC5;&#x5907;&#x7684;&#x98DF;&#x7269;&#x7B49;&#x7269;&#x8D44;&#xFF0C;&#x4F7F;<strong>&#x6A21;&#x62DF;&#x7ECF;&#x8425;</strong>&#x6210;&#x4E3A;&#x6E38;&#x620F;&#x8FDB;&#x7A0B;&#x4E0D;&#x53EF;&#x6216;&#x7F3A;&#x7684;&#x4E00;&#x90E8;&#x5206;</li>
<li>&#x6218;&#x6597;&#xFF1A;<ul>
<li>&#x654C;&#x5BF9;&#x751F;&#x7269;&#x7684;&#x653B;&#x51FB;&#x96BE;&#x5EA6;&#x4F4E;&#xFF0C;&#x90AA;&#x6076;&#x751F;&#x7269;&#x653B;&#x51FB;&#x96BE;&#x5EA6;&#x9AD8;</li>
<li>&#x654C;&#x5BF9;&#x751F;&#x7269;&#x7684;&#x6570;&#x91CF;&#x8BBE;&#x8BA1;&#x9AD8;&#xFF0C;&#x90AA;&#x6076;&#x751F;&#x7269;&#x7684;&#x6570;&#x91CF;&#x4F4E;</li>
<li>&#x90AA;&#x6076;&#x751F;&#x7269;&#x56E0;&#x5176;&#x5E26;&#x6709;&#x6982;&#x7387;&#x6027;&#x7684;<strong>&#x8D1F;&#x9762;&#x5F71;&#x54CD;&#xFF08;Debuff&#xFF09;</strong>&#xFF0C;&#x56E0;&#x6B64;&#x5728;&#x6218;&#x6597;&#x65F6;&#x8981;&#x66F4;&#x52A0;&#x5C0F;&#x5FC3;</li>
</ul>
</li>
<li>&#x6E38;&#x620F;&#x6A21;&#x5F0F;<ul>
<li>&#x65E0;&#x5C3D;&#x6A21;&#x5F0F;&#xFF1A;&#x73A9;&#x5BB6;&#x53EF;&#x4EE5;&#x590D;&#x6D3B;&#xFF0C;&#x4F46;&#x540C;&#x65F6;&#x4F1A;&#x4ED8;&#x51FA;&#x4E00;&#x4E9B;&#x4EE3;&#x4EF7;</li>
<li>&#x6311;&#x6218;&#x6A21;&#x5F0F;&#xFF1A;&#x73A9;&#x5BB6;&#x4E0D;&#x53EF;&#x4EE5;&#x590D;&#x6D3B;&#xFF08;&#x4F46;&#x662F;&#x5982;&#x679C;&#x6709;&#x590D;&#x6D3B;&#x9053;&#x5177;&#xFF0C;&#x53EF;&#x4EE5;&#x590D;&#x6D3B;&#xFF09;&#xFF0C;&#x6B7B;&#x4EA1;&#x540E;&#x4F1A;&#x9009;&#x62E9;&#x91CD;&#x7F6E;&#x4E16;&#x754C;</li>
</ul>
</li>
<li>&#x73A9;&#x5BB6;&#x751F;&#x5B58;<ul>
<li>&#x73A9;&#x5BB6;&#x6709;&#x51E0;&#x9879;&#x5C5E;&#x6027;&#xFF1A;&#x751F;&#x547D;&#x503C;&#x3001;&#x80FD;&#x529B;&#x7B49;&#x7EA7;&#x3001;&#x4F53;&#x529B;&#x3001;&#x7CBE;&#x795E;</li>
<li>&#x73A9;&#x5BB6;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x98DF;&#x7269;&#x548C;&#x6C34;&#x6765;&#x6EE1;&#x8DB3;&#x57FA;&#x672C;&#x7684;&#x751F;&#x6D3B;&#x4FDD;&#x969C;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5FC5;&#x987B;&#x8FDB;&#x884C;&#x79CD;&#x690D;&#x548C;&#x755C;&#x7267;&#xFF0C;&#x540E;&#x671F;&#x53EF;&#x4EE5;&#x8D2D;&#x4E70;</li>
<li>&#x5546;&#x5E97;&#x8D2D;&#x4E70;&#xFF1A;&#x8BBE;&#x8BA1;&#x57FA;&#x7840;&#x7269;&#x8D44;&#x53EF;&#x4EE5;&#x8D2D;&#x4E70;&#xFF0C;&#x4F46;&#x662F;&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x57FA;&#x7840;&#x7269;&#x8D44;&#x90FD;&#x80FD;<strong>&#x5927;&#x91CF;&#x8D2D;&#x4E70;</strong></li>
<li>&#x73A9;&#x5BB6;&#x53EF;&#x4E0D;&#x5FC5;&#x6BCF;&#x5929;&#x7761;&#x89C9;&#xFF0C;&#x4F46;&#x662F;&#x7CBE;&#x795E;&#x503C;&#x7684;&#x6062;&#x590D;&#x9700;&#x8981;&#x7761;&#x89C9;&#x3002;&#x6E38;&#x620F;&#x4E2D;&#x5F31;&#x5316;&#x7761;&#x89C9;&#x8FD9;&#x4E00;<strong>&#x5FC5;&#x8981;&#x4F46;&#x4E0D;&#x662F;&#x7279;&#x522B;&#x91CD;&#x7684;</strong>&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x8BA9;&#x73A9;&#x5BB6;&#x6709;&#x66F4;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x6295;&#x5165;&#x5230;&#x6A21;&#x62DF;&#x7ECF;&#x8425;&#x548C;&#x751F;&#x5B58;&#x5192;&#x9669;&#x4E2D;&#x53BB;&#x3002;</li>
</ul>
</li>
</ul>
<p>&#x6E38;&#x620F;&#x96BE;&#x5EA6;&#x9009;&#x62E9;&#xFF1A;</p>
<ul>
<li>&#x73A9;&#x5BB6;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x6E38;&#x620F;&#x7684;&#x6A21;&#x5F0F;</li>
<li>&#x654C;&#x5BF9;&#x751F;&#x7269;&#x3001;&#x90AA;&#x6076;&#x751F;&#x7269;&#x7684;&#x6570;&#x91CF;&#x9009;&#x62E9;&#xFF08;&#x6781;&#x5C11;&#x3001;&#x5C11;&#x3001;&#x6B63;&#x5E38;&#x3001;&#x591A;&#xFF09;</li>
</ul>
<h1 id="&#x6E38;&#x620F;&#x4EE3;&#x5165;&#x611F;"><a name="&#x6E38;&#x620F;&#x4EE3;&#x5165;&#x611F;" class="anchor-navigation-ex-anchor" href="#&#x6E38;&#x620F;&#x4EE3;&#x5165;&#x611F;"><i class="fa fa-link" aria-hidden="true"></i></a>&#x6E38;&#x620F;&#x4EE3;&#x5165;&#x611F;</h1>
<ul>
<li>&#x57CE;&#x9547;&#x8981;&#x4F53;&#x73B0;&#x7965;&#x548C;&#x5B81;&#x9759;&#x7684;&#x6C1B;&#x56F4;&#xFF0C;&#x867D;&#x7136;&#x4E16;&#x754C;&#x6CA1;&#x843D;&#xFF0C;&#x4F46;&#x662F;&#x65B0;&#x6587;&#x660E;&#x7684;&#x706B;&#x79CD;&#x603B;&#x662F;&#x5728;&#x9ED1;&#x6697;&#x4E2D;&#x95EA;&#x70C1;&#x7740;&#xFF0C;&#x4F9D;&#x65E7;&#x5145;&#x6EE1;&#x5E0C;&#x671B;&#xFF1B;&#x540C;&#x65F6;&#xFF0C;&#x7531;&#x4E8E;<strong>&#x65F6;&#x7A7A;&#x88C2;&#x75D5;</strong>&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x4E0D;&#x5B9A;&#x671F;&#x7ED9;&#x5C45;&#x6C11;&#x7684;&#x751F;&#x6D3B;&#x5E26;&#x6765;&#x51B2;&#x51FB;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x9020;&#x6210;&#x4EBA;&#x5458;&#x7684;&#x6B7B;&#x4EA1;&#x3002;</li>
<li>&#x5143;&#x7D20;&#x5927;&#x9646;&#xFF1A;&#x4F9D;&#x636E;&#x4E0D;&#x540C;&#x5143;&#x7D20;&#x7684;&#x4F5C;&#x7528;&#x4EE5;&#x53CA;&#x5F71;&#x54CD;&#xFF0C;&#x4F53;&#x73B0;&#x51FA;&#x5BF9;&#x5E94;&#x7684;&#x98CE;&#x683C;&#x3002;</li>
<li>&#x8FDC;&#x53E4;&#x9057;&#x8FF9;&#xFF1A;&#x4E0D;&#x4EC5;&#x8981;&#x4F53;&#x73B0;&#x51FA;&#x5BF9;&#x5E94;&#x7684;&#x5143;&#x7D20;&#x98CE;&#x683C;&#xFF0C;&#x8FD8;&#x8981;&#x4F53;&#x73B0;&#x51FA;&#x6CA1;&#x843D;&#x3001;&#x7834;&#x8D25;&#x3001;&#x6CA7;&#x6851;&#x3001;&#x5386;&#x53F2;&#x7684;&#x611F;&#x89C9;&#xFF0C;&#x540C;&#x65F6;&#x6839;&#x636E;&#x65E7;&#x795E;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x6784;&#x5EFA;&#x5BF9;&#x5E94;&#x795E;&#x660E;&#x4E0B;&#x7684;&#x9057;&#x8FF9;&#x56FE;&#x817E;&#x6807;&#x5FD7;&#x3002;</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="2游戏故事背景.html" class="navigation navigation-prev " aria-label="Previous page: 游戏故事背景">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="4游戏规则设计/4游戏规则设计.html" class="navigation navigation-next " aria-label="Next page: 游戏规则设计">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"游戏设计目标","level":"2.3","depth":1,"next":{"title":"游戏规则设计","level":"2.4","depth":1,"path":"游戏策划/4游戏规则设计/4游戏规则设计.md","ref":"游戏策划/4游戏规则设计/4游戏规则设计.md","articles":[{"title":"用户输入设计","level":"2.4.1","depth":2,"path":"游戏策划/4游戏规则设计/用户输入设计.md","ref":"游戏策划/4游戏规则设计/用户输入设计.md","articles":[]}]},"previous":{"title":"游戏故事背景","level":"2.2","depth":1,"path":"游戏策划/2游戏故事背景.md","ref":"游戏策划/2游戏故事背景.md","articles":[]},"dir":"ltr"},"config":{"plugins":["katex","hide-element","back-to-top-button","expandable-chapters-small","code","splitter","ga","sidebar-style","anchor-navigation-ex","-sharing","sharing-plus","-lunr","-search","search-pro","lightbox","github","auto-scroll-table"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"sidebar-style":{"author":"YuiLexi","title":"《Ruins Land》游戏策划"},"github":{"url":"https://github.com/YuiLexi"},"splitter":{},"search-pro":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"auto-scroll-table":{},"code":{"copyButtons":false},"hide-element":{"elements":[".gitbook-link"]},"katex":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"anchor-navigation-ex":{"showLevelIcon":false,"mode":"float","pageTop":{"level1Icon":"","level2Icon":"","level3Icon":"","showLevelIcon":false},"showLevel":false,"tocLevel1Icon":"fa fa-hand-o-right","tocLevel2Icon":"fa fa-hand-o-right","tocLevel3Icon":"fa fa-hand-o-right","showGoTop":true,"printLog":false,"multipleH1":false,"multipleH2":false,"associatedWithSummary":true,"multipleH3":false,"float":{"floatIcon":"fa fa-navicon","level1Icon":"","level2Icon":"","level3Icon":"","showLevelIcon":false},"multipleH4":false},"lightbox":{"jquery":true,"sameUuid":false},"back-to-top-button":{},"expandable-chapters-small":{},"ga":{"configuration":"auto","token":"KEY-YUILEXI"},"sharing":{"qq":false,"all":["douban","facebook","google","instapaper","linkedin","twitter","weibo","messenger","qq","qzone","viber","whatsapp"],"douban":false,"facebook":false,"weibo":true,"twitter":false,"pocket":false,"google":true,"qzone":true},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"YuiLexi","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Ruins Land","language":"zh-hans","links":{"sidebar":{"个人博客":"https://blog.yuilexi.cn","GitHub":"https://github.com/YuiLexi"}},"gitbook":"*","description":"这是个人独立游戏《特拉之地》的开发说明文档"},"file":{"path":"游戏策划/3游戏设计目标.md","mtime":"2023-05-31T06:01:31.918Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2023-06-18T12:52:26.612Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-ga/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sidebar-style/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lightbox/js/lightbox.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-auto-scroll-table/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

